Autodesk.Revit.DB.ICloudExternalServerProxy.GetCloudModelInformationFromModelPath(System.String,System.String,System.String,System.String)
Gets cloud model information from project id, folder id and model name.
region:
The BIM 360 account and project region.
projectId:
Project identity in BIM 360.
folderId:
Folder identity in BIM 360.
modelName:
Model name in BIM 360.
Returns:
Returns cloud model information.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServerProxy.GetProjectInfoFromFolderLocationInformation(System.String,System.String,Autodesk.Revit.CloudProjectInfo)
accountId:
The BIM 360 account Id.
projectId:
The BIM 360 project Id.
data:
Cloud external data as output.
Since:
2019

Autodesk.Revit.DB.ICloudExternalServerProxy.CheckFolderPermissionsForSaveAs(System.String,System.String,System.String)
check if the folder has permissions for saving as cloud model
region:
The BIM 360 account and project region.
projectId:
Project identity in BIM 360.
folderId:
Folder identity in BIM 360.
Returns:
Returns true if the folder has at least "Edit" permission
Since:
2019

Autodesk.Revit.DB.ICloudExternalServerProxy.GetProjectInfoFromFolderId(System.String,Autodesk.Revit.CloudProjectInfo)
folderId:
Folder identity in BIM 360.
data:
Cloud external data as output
Since:
2019

Autodesk.Revit.DB.ICloudExternalServerProxy.GetProjectInfoFromHubProjectId(Autodesk.Revit.CloudProjectInfo)
data:
Cloud external data as output
Since:
2019